app/controllers/api/steps_controller.rb

    def index
        @steps = Todo.find(params[:todo_id]).steps
---
SELECT "steps".* FROM "steps" WHERE "steps"."todo_id" = $1  [["todo_id", 17]]
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

    def create
        @step = Step.new(step_params)
        if @step.save
---
INSERT INTO "steps" ("title", "body", "todo_id", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "kill niggers"], ["body", ""], ["todo_id", 18], ["done", false], ["created_at", "2020-02-10 04:10:29.738852"], ["updated_at", "2020-02-10 04:10:29.738852"]]

    def update
        @step = Step.find(params[:id])
        if @step.update(step_params)
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "steps" SET "body" = $1, "done" = $2, "updated_at" = $3 WHERE "steps"."id" = $4  [["body", ""], ["done", true], ["updated_at", "2020-02-10 04:09:23.955740"], ["id", 1]]

    def destroy
        @step = Step.find(params[:id]).destroy
---
DELETE FROM "steps" WHERE "steps"."id" = $1  [["id", 1]]
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]