app/controllers/api/todos_controller.rb

    def index
        # let all_todos = Todo.all
        # going to have tp iterate through all todos, and insert into a
        # json servable object, do this in the jbuilder index view
        # render json: Todo.all.where(user_id: current_user.id)
        render json: Todo.all, include: :tags
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."todo_id" = $1  [["todo_id", 17]]
SELECT "todos".* FROM "todos"

    def show
        render json: Todo.find(params[:id]), include: :tags
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."todo_id" = $1  [["todo_id", 19]]
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        @todo = Todo.find(params[:id])
        if @todo.update(todo_update_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2020-02-03 23:53:23.222528"], ["id", 4]]