app/models/todo.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "algorithms"], ["created_at", "2020-02-11 02:11:37.841882"], ["updated_at", "2020-02-11 02:11:37.841882"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "algorithms"], ["LIMIT", 1]]
---
    def tag_names=(tag_names)
        self.tags = tag_names.map do |tag_name|
            Tag.find_or_create_by(name: tag_name)